In [1]:
import pandas as pd

# Series

In [2]:
odd = [1, 3, 5, 7,9]
odd

[1, 3, 5, 7, 9]

In [3]:
pd_odd = pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [4]:
pd_odd.mean()

5.0

## 리스트보다 시리즈를 쓰는 것이 판다스를 활용하는데 더 좋다

## DataFrame

In [5]:
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [7]:
type(numbers)

pandas.core.frame.DataFrame

In [8]:
type(numbers[0])

pandas.core.series.Series

In [9]:
type(numbers.loc[0])

pandas.core.series.Series

In [10]:
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [12]:
numbers.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

### Data Type

In [13]:
# int == interger == 정수형
type(1)

int

In [14]:
type(1.0)

float

In [15]:
type("Hello world!")

str

In [16]:
odd = [1, 3, 5, 7, 9]

odd = pd.Series(odd)

odd.dtypes

dtype('int64')

In [17]:
odd = [1, 3, 5, 7, 9, 'hello!']

odd = pd.Series(odd)

# O == Object == str == string
odd.dtypes

dtype('O')

### NaN (Not a Number)

In [18]:
import numpy as np

odd = [1, np.nan, 5, 7,9]

odd = pd.Series(odd)

odd.dtypes

odd

0    1.0
1    NaN
2    5.0
3    7.0
4    9.0
dtype: float64

In [19]:
odd.mean()

5.5

In [20]:
import numpy as np

odd = [1, -1, 5, 7,9]

odd = pd.Series(odd)

odd.mean()

# 데이터를 분석하는 입장에서는 -1 처럼 정의하는 건 문제가 있을 수 있다.

4.2

In [21]:
np.nan == np.nan

False

In [22]:
value = np.nan

pd.isnull(value)

True

In [23]:
pd.isnull(np.nan)

True

In [24]:
pd.notnull(value)

False

## DataFrame

### 생성하기

In [25]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-03', 700, 'confirmed'],
    ['2017-01-10', 200, 'canceled']    
]

columns = ['date', 'price', 'state']

order = pd.DataFrame(order, columns = columns)

order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [26]:
#방식2

oder = {
    'date' : ['2017-01-01', '2017-01-03','2017-01-10'],
    'price' : [500, 700, 200],
    'state' : ['confiremd', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [27]:
#방식3

order = [
    {'date' : '2017-01-01', 'price': 500, 'state':'confirmed'},
    {'date' : '2017-01-03', 'price': 700, 'state':'confirmed'},
    {'date' : '2017-01-10', 'price': 200, 'state':'canceled'}
]

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

### pandas에서는 보통 방식2를 선호하지만, 실제로 데이터를 수집하는 과정에서는 방식3을 쓰는 경우가 많아서 방식3을 많이 활용할 여지가 있다.

In [28]:
order_url = "https://bit.ly/dsa-01-order"

order = pd.read_csv(order_url)

order.columns

Index(['id', 'user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [29]:
order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

In [30]:
order_url = "https://bit.ly/dsa-01-order"

order = pd.read_csv(order_url, index_col = "id")

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [31]:
order_url = "https://bit.ly/dsa-01-order"

order = pd.read_csv(order_url)
order = order.set_index("id")

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [32]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [33]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [34]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [35]:
type(order.index)

pandas.core.indexes.numeric.Int64Index

In [36]:
order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result']

order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [37]:
order.head(1)

    user_id  product_id        date  amount address     result
id
1         3           9  2017-01-01     500   Seoul  confirmed

In [38]:
order.head(5)

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed

In [39]:
order.tail()

    user_id  product_id        date  amount  address     result
id
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [40]:
order.tail(1)

    user_id  product_id        date  amount address    result
id
7         2           5  2017-01-10     200     NaN  canceled

In [41]:
order["date"].head()

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
Name: date, dtype: object

# 기본연산

In [42]:
order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [43]:
order["amount"].mean()

585.7142857142857

In [44]:
order["amount"].min()

200

In [45]:
order["amount"].max()

900

In [46]:
order["amount"].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [47]:
order["result"]

id
1    confirmed
2    confirmed
3    confirmed
4     canceled
5    confirmed
6     canceled
7     canceled
Name: result, dtype: object

In [48]:
order["result"].describe()

count             7
unique            2
top       confirmed
freq              4
Name: result, dtype: object

In [49]:
order["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

In [50]:
order["result"].value_counts()

confirmed    4
canceled     3
Name: result, dtype: int64

In [51]:
order["result"].value_counts(normalize = True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

In [135]:
order["result_revised"] = order["result"].replace("confirmed", "confirm").replace("canceled", "cancel")

In [128]:
del order["result_revised"]

order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,1,False
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,2,True
3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,3,True
4,4,2,2017-01-07,500,NaN,canceled,KB Card,4,False
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,5,True
6,5,7,2017-01-09,600,Busan,canceled,KB Card,6,False
7,2,5,2017-01-10,200,NaN,canceled,KB Card,7,False

In [ ]:
order["date"] = pd.to_datetime(order["date"])

order["date"].dt.year
order["date"].dt.month
order["date"].dt.hour

### 행렬 검색하기

In [ ]:
order[["date", "amount"]]

In [ ]:
type(order[["date", "amount"]])

In [ ]:
type(order)

In [ ]:
type(order["date"])

## 1-12까지 학습

In [54]:
# loc == locate

order.loc[1]

user_id                    3
product_id                 9
date              2017-01-01
amount                   500
address                Seoul
result             confirmed
result_revised       confirm
Name: 1, dtype: object

In [55]:
order.loc[[1, 3,]]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm

In [56]:
order_ids = [1, 3, 7]

order.loc[order_ids]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
7         2           5  2017-01-10     200      NaN   canceled         cancel

In [61]:
type(order.loc[order_ids])

pandas.core.frame.DataFrame

## 행열 동시에 가져오기

In [63]:
order.loc[1]["date"]

'2017-01-01'

In [67]:
order.loc[1, "date"]

'2017-01-01'

In [65]:
%timeit order.loc[1]["date"]

142 µs ± 7.05 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [68]:
%timeit order.loc[1, "date"]

5.58 µs ± 215 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [69]:
order.at[1, "date"]

'2017-01-01'

In [71]:
# at이 빠르지만 여러개의 값을 가져올 수 없음

%timeit order.at[1, "date"]

3.58 µs ± 246 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [73]:
order.loc[[1, 3, 5], ["date", "amount"]]

          date  amount
id
1   2017-01-01     500
3   2017-01-03     900
5   2017-01-09     700

### 색인

In [76]:
order[order["date"] == "2017-01-03"]

    user_id  product_id        date  amount  address     result result_revised
id
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm

In [78]:
order[order["date"] != "2017-01-03"]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
4         4           2  2017-01-07     500      NaN   canceled         cancel
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel
7         2           5  2017-01-10     200      NaN   canceled         cancel

In [79]:
order[order["amount"] > 500]

    user_id  product_id        date  amount  address     result result_revised
id
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel

In [81]:
date_candidates = ["2017-01-01", "2017-01-05", "2017-01-09"]

date_candidates

['2017-01-01', '2017-01-05', '2017-01-09']

In [82]:
order[order["date"].isin(date_candidates)]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel

In [85]:
order[order["address"].isnull()]

    user_id  product_id        date  amount address    result result_revised
id
4         4           2  2017-01-07     500     NaN  canceled         cancel
7         2           5  2017-01-10     200     NaN  canceled         cancel

In [87]:
order[~order["address"].isnull()]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel

In [88]:
order[order["address"].notnull()]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel

In [95]:
# and &

order[(order["result_revised"]=="confirm") & (order["amount"] > 500)]

    user_id  product_id        date  amount  address     result result_revised
id
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
5         7           3  2017-01-09     700  Incheon  confirmed        confirm

In [141]:
confirm = order["result_revised"]=="confirm"
high = order["amount"] >= 500


order[high & confirm]

,user_id,product_id,date,amount,address,result,card-holder,VIP,result_revised,status
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,False,confirm,none-VIP
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,True,confirm,VIP
3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,True,confirm,VIP
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,True,confirm,VIP

In [100]:
# or |

order[high | confirm]

    user_id  product_id        date  amount  address     result result_revised
id
1         3           9  2017-01-01     500    Seoul  confirmed        confirm
2         1           7  2017-01-03     700    Seoul  confirmed        confirm
3         3           8  2017-01-03     900  Daejeon  confirmed        confirm
5         7           3  2017-01-09     700  Incheon  confirmed        confirm
6         5           7  2017-01-09     600    Busan   canceled         cancel

In [104]:
order.loc[order["date"] == "2017-01-09","amount"]

id
5    700
6    600
Name: amount, dtype: int64

In [105]:
order.loc[order["date"] == "2017-01-09","amount"].mean()

650.0

In [107]:
order.loc[order["date"] == "2017-01-09",["date", "amount", "result"]]

          date  amount     result
id
5   2017-01-09     700  confirmed
6   2017-01-09     600   canceled

## 컬럼 추가 & 수정하기

In [115]:
order["card-holder"] = "KB Card"
order

,user_id,product_id,date,amount,address,result,result_revised,card-holder
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,confirm,KB Card
2,1,7,2017-01-03,700,Seoul,confirmed,confirm,KB Card
3,3,8,2017-01-03,900,Daejeon,confirmed,confirm,KB Card
4,4,2,2017-01-07,500,NaN,canceled,cancel,KB Card
5,7,3,2017-01-09,700,Incheon,confirmed,confirm,KB Card
6,5,7,2017-01-09,600,Busan,canceled,cancel,KB Card
7,2,5,2017-01-10,200,NaN,canceled,cancel,KB Card

In [123]:
order["VIP"] = [1, 2, 3, 4, 5, 6, 7]
order

,user_id,product_id,date,amount,address,result,result_revised,card-holder,order,VIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,confirm,KB Card,1,1
2,1,7,2017-01-03,700,Seoul,confirmed,confirm,KB Card,2,2
3,3,8,2017-01-03,900,Daejeon,confirmed,confirm,KB Card,3,3
4,4,2,2017-01-07,500,NaN,canceled,cancel,KB Card,4,4
5,7,3,2017-01-09,700,Incheon,confirmed,confirm,KB Card,5,5
6,5,7,2017-01-09,600,Busan,canceled,cancel,KB Card,6,6
7,2,5,2017-01-10,200,NaN,canceled,cancel,KB Card,7,7

In [124]:
order["VIP"] = order["amount"] >= 500
order

,user_id,product_id,date,amount,address,result,result_revised,card-holder,order,VIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,confirm,KB Card,1,True
2,1,7,2017-01-03,700,Seoul,confirmed,confirm,KB Card,2,True
3,3,8,2017-01-03,900,Daejeon,confirmed,confirm,KB Card,3,True
4,4,2,2017-01-07,500,NaN,canceled,cancel,KB Card,4,True
5,7,3,2017-01-09,700,Incheon,confirmed,confirm,KB Card,5,True
6,5,7,2017-01-09,600,Busan,canceled,cancel,KB Card,6,True
7,2,5,2017-01-10,200,NaN,canceled,cancel,KB Card,7,False

In [132]:
order["VIP"] = high & confirm
order

,user_id,product_id,date,amount,address,result,card-holder,VIP
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,False
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,True
3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,True
4,4,2,2017-01-07,500,NaN,canceled,KB Card,False
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,True
6,5,7,2017-01-09,600,Busan,canceled,KB Card,False
7,2,5,2017-01-10,200,NaN,canceled,KB Card,False

In [134]:
order

,user_id,product_id,date,amount,address,result,card-holder,VIP
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,False
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,True
3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,True
4,4,2,2017-01-07,500,NaN,canceled,KB Card,False
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,True
6,5,7,2017-01-09,600,Busan,canceled,KB Card,False
7,2,5,2017-01-10,200,NaN,canceled,KB Card,False

In [142]:
order.loc[high&confirm, "status"] = "VIP"
order.loc[~high|~confirm, "status"] = "none-VIP"
order

,user_id,product_id,date,amount,address,result,card-holder,VIP,result_revised,status
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,False,confirm,VIP
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,True,confirm,VIP
3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,True,confirm,VIP
4,4,2,2017-01-07,500,NaN,canceled,KB Card,False,cancel,none-VIP
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,True,confirm,VIP
6,5,7,2017-01-09,600,Busan,canceled,KB Card,False,cancel,none-VIP
7,2,5,2017-01-10,200,NaN,canceled,KB Card,False,cancel,none-VIP

### 삭제하기

In [148]:
order = order.drop(["status", "VIP"], axis = "columns")

order

KeyError: "['status' 'VIP'] not found in axis"

In [150]:
order.drop(3)

,user_id,product_id,date,amount,address,result,card-holder,result_revised
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,confirm
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,confirm
4,4,2,2017-01-07,500,NaN,canceled,KB Card,cancel
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,confirm
6,5,7,2017-01-09,600,Busan,canceled,KB Card,cancel
7,2,5,2017-01-10,200,NaN,canceled,KB Card,cancel

In [151]:
order.drop(3, axis = "rows")

,user_id,product_id,date,amount,address,result,card-holder,result_revised
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,confirm
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,confirm
4,4,2,2017-01-07,500,NaN,canceled,KB Card,cancel
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,confirm
6,5,7,2017-01-09,600,Busan,canceled,KB Card,cancel
7,2,5,2017-01-10,200,NaN,canceled,KB Card,cancel

### apply

In [160]:
def is_vip(amount):
    if amount >= 500:
        return "VIP"
    else:
        return "Non-VIP"

order["amount"].apply(is_vip)

id
1        VIP
2        VIP
3        VIP
4        VIP
5        VIP
6        VIP
7    Non-VIP
Name: amount, dtype: object

In [167]:
def is_vip(row):
    amount = row["amount"]
    result = row["result"]
    
    if amount >= 500 and result == "confirmed":
        return "VIP"
    else:
        return "None-VIP"
    
    return result

order["status"] = order.apply(is_vip, axis = "columns")
order

,user_id,product_id,date,amount,address,result,card-holder,result_revised,status
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,confirm,VIP
2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,confirm,VIP
3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,confirm,VIP
4,4,2,2017-01-07,500,NaN,canceled,KB Card,cancel,None-VIP
5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,confirm,VIP
6,5,7,2017-01-09,600,Busan,canceled,KB Card,cancel,None-VIP
7,2,5,2017-01-10,200,NaN,canceled,KB Card,cancel,None-VIP